; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		l a y e s t f b m - block
	)
	(:init
		(handempty)
		(clear b)
		(ontable b)
		(clear e)
		(ontable e)
		(clear s)
		(on s t)
		(on t f)
		(ontable f)
		(clear l)
		(ontable l)
		(clear m)
		(ontable m)
		(clear a)
		(on a y)
		(ontable y)
	)
	(:goal (and
		;; yeast
		(clear y) (ontable t) (on y e) (on e a) (on a s) (on s t)
	))
)

; plan
1. (unstack s t)
   deleted: (clear s) (handempty) (on s t)
   added: (holding s) (clear t)
   goals met: 0 of 6
2. (put-down s)
   deleted: (holding s)
   added: (clear s) (handempty) (ontable s)
   goals met: 0 of 6
3. (unstack t f)
   deleted: (clear t) (handempty) (on t f)
   added: (holding t) (clear f)
   goals met: 0 of 6
4. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 1 of 6
5. (pick-up s)
   deleted: (ontable s) (clear s) (handempty)
   added: (holding s)
   goals met: 1 of 6
6. (stack s t)
   deleted: (holding s) (clear t)
   added: (clear s) (handempty) (on s t)
   goals met: 2 of 6
7. (unstack a y)
   deleted: (clear a) (handempty) (on a y)
   added: (holding a) (clear y)
   goals met: 3 of 6
8. (stack a s)
   deleted: (holding a) (clear s)
   added: (clear a) (handempty) (on a s)
   goals met: 4 of 6
9. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 4 of 6
10. (stack e a)
   deleted: (holding e) (clear a)
   added: (clear e) (handempty) (on e a)
   goals met: 5 of 6
11. (pick-up y)
   deleted: (ontable y) (clear y) (handempty)
   added: (holding y)
   goals met: 4 of 6
12. (stack y e)
   deleted: (holding y) (clear e)
   added: (clear y) (handempty) (on y e)
   goals met: 6 of 6
